app/controllers/shorten_urls_controller.rb

SELECT  "shorten_urls".* FROM "shorten_urls" WHERE "shorten_urls"."little_url" IS NULL LIMIT ?  [["LIMIT", 1]]
---
  def show
    @shorten_url = ShortenUrl.find_by(little_url: params[:little_url])