app/controllers/shorten_urls_controller.rb

  def index
    @shorten_urls = ShortenUrl.all
---
SELECT "shorten_urls".* FROM "shorten_urls"

  def create
    @shorten_url = ShortenUrl.new(shorten_url_params)

    respond_to do |format|
      if @shorten_url.save
---
INSERT INTO "shorten_urls" ("original_url", "little_url", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["original_url", "aowiebdfshj"], ["little_url", ""], ["created_at", "2020-01-22 15:04:39.788695"], ["updated_at", "2020-01-22 15:04:39.788695"]]

    def set_shorten_url
      @shorten_url = ShortenUrl.find(params[:id])
---
SELECT  "shorten_urls".* FROM "shorten_urls" WHERE "shorten_urls"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]